Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བསླབས་པས། འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: If you ask why, by having trained in this same perfection of wisdom, the tathāgatas, arhats, completely awakened buddhas of the past, future, and present have attained, will attain, and are attaining consummate buddhahood in unsurpassed, complete enlightenment.

source: །མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་དེ་དག་ཀྱང་། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལས་གུད་ན་མེད་དེ།
en: Those who are chaste in conduct are indeed none other than the irreversible bodhisattvas.

source: དེ་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བསླབས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: They too have trained in this same perfection of wisdom and they have attained, will attain, and are attaining consummate buddhahood in unsurpassed, complete enlightenment. {

source: །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Ki.

source: །ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བསླབས་ཤིང་། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱིས་ཀྱང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་བོ། །འཐོབ་བོ། །ཐོབ་པར་འགྱུར་རོ། །དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་དུ་ཐོབ་པོ།
en: II-III: 102} “Kauśika, having trained in this same perfection of wisdom, those who follow the vehicle of the śrāvakas also have attained, will attain, and are attaining the fruit of entering the stream to nirvāṇa, and they have attained, will attain, and are attaining [the other fruits], up to and including arhatship.

source: །འཐོབ་བོ། །ཐོབ་པར་འགྱུར་རོ། །རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱིས་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བསླབས་ཤིང་། རང་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Having trained in this same perfection of wisdom, those who follow the vehicle of the pratyekabuddhas, too, have attained, will attain, and are attaining consummate buddhahood in individual enlightenment.

source: །མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བསླབས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་སོ།
en: Having trained in this same perfection of wisdom, bodhisattva great beings, too, have entered, will enter, and are entering the maturity of the bodhisattvas.

source: །འཇུག་གོ། །འཇུག་པར་འགྱུར་རོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་དེ་བས་ན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: They have attained, will attain, and are attaining consummate buddhahood in unsurpassed, complete enlightenment. “

source: སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་མངོན་དུ་རིམ་གྲོར་བྱ་བར་འདོད་པ་དང་། བཀུར་སྟིར་བྱ་བར་འདོད་པ་དང་། བསྟི་སྟང་དུ་བྱ་བར་འདོད་པ་དང་། མཆོད་པར་བྱ་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཏེ། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱའོ། །བཀུར་སྟིར་བྱའོ། །བསྟི་སྟང་དུ་བྱའོ། །མཆོད་པར་བྱའོ། །ཀཽ་ཤི་ཀ་ངས་དོན་དེ་ཉིད་ཀྱི་དབང་ཡང་དག་པར་མཐོང་སྟེ།
en: Therefore, Kauśika, the noble sons or noble daughters who wish to honor, who wish to respect, who wish to venerate, and who wish to worship the tathāgatas, arhats, completely awakened buddhas with flowers, garlands, perfume, unguents, incense, butter lamps, powders, religious robes, parasols, victory banners, ribbons, and diverse musical sounds, should commit this perfection of wisdom to writing and they should then serve, respect, honor, and worship it with flowers, garlands, perfume, unguents, incense, butter lamps, powders, religious robes, parasols, victory banners, ribbons, and diverse musical sounds. “

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་འདི་སྙམ་སྟེ། གང་ཞིག་ལ་བདག་གིས་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པ་བྱས་ཏེ།
en: Kauśika, I also considered this fact when, after attaining consummate buddhahood in unsurpassed, complete enlightenment, I thought, ‘What should I serve, respect, honor, and worship?

source: བརྟེན་ཅིང་རྣམ་པར་སྤྱད་པར་བྱ་སྙམ་ན་ཡང་།
en: In dependence on whom should I dwell?’

source: ཀཽ་ཤི་ཀ་དེ་ལ་ངས་འཇིག་རྟེན་ལྷ་དང་བཅས་པ། བདུད་དང་བཅས་པ། ཚངས་པ་དང་བཅས་པ། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་ནང་ན། ང་དང་འདྲ་བའམ། ལྷག་པ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ནས། དེ་ལ་ངས་འདི་སྙམ་དུ་བསམས་ཏེ། དེ་ལྟ་ཡིན་ན་བདག་གིས་ཆོས་ཞི་བ་བཟང་པོ་གང་བདག་ཉིད་ཀྱིས་མངོན་པར་སངས་རྒྱས་པ་དེ་ཉིད་ལ་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་།
en: Indeed, Kauśika, when I did not observe anyone similar or superior to me in this world with its gods, with its māras, with its Brahmā deities, with its people including virtuous ascetics and brāhmin priests, and with its gods, humans, and asuras, I thought, ‘In that case, I should serve, respect, honor, and worship the Dharma, that noble peace, through which I myself attained manifest buddhahood.

source: བསྟི་སྟང་དང་། མཆོད་པ་བྱས་ཏེ། བརྟེན་ཅིང་རྣམ་པར་སྤྱད་པར་བྱའོ།
en: I should dwell in dependence on that.’ “

source: སྙམ་དུ་བསམས་སོ། ཀཽ་ཤི་ཀ་ཆོས་དེ་ཡང་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ཡིན་ཏེ།
en: Kauśika, if you ask what is that Dharma, it is this same perfection of wisdom.

source: ཀཽ་ཤི་ཀ་དེ་ལྟར་ང་ཉིད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་རིམ་གྲོར་བྱེད། བཀུར་སྟིར་བྱེད། བསྟི་སྟང་དུ་བྱེད། མཆོད་པར་བྱེད་དེ། དེ་ལྟར་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་།
en: So it is, Kauśika, that I myself serve, respect, honor, and worship this perfection of wisdom.

source: བསྟི་སྟང་དང་། མཆོད་པ་བྱས་ཤིང་རྣམ་པར་སྤྱོད་ན། ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་། བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པར་བྱ་བ་ལྟ་ཅི་སྨོས།
en: If I serve, respect, honor, and worship it and dwell in that manner, Kauśika, it goes without saying that those noble sons or noble daughters who wish to attain consummate buddhahood in unsurpassed, complete enlightenment should serve, respect, honor, and worship the perfection of wisdom with flowers, garlands, perfume, unguents, incense, butter lamps, powders, religious robes, parasols, victory banners, ribbons, and diverse musical sounds.

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་།
en: It goes without saying that those noble sons or noble daughters who follow the vehicle of the śrāvakas and those noble sons or noble daughters who follow the vehicle of the pratyekabuddhas should serve, respect, honor, and worship this same perfection of wisdom with flowers, garlands, perfume, unguents, incense, butter lamps, powders, robes, parasols, victory banners, ribbons, and diverse musical sounds.

source: བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པར་བྱ་བ་ལྟ་ཅི་སྨོས། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་བ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སོ།
en: If you ask why, bodhisattva great beings have originated from the perfection of wisdom.

source: །བྱང་ཆུབ་སེམས་དཔའ་ལས་བྱུང་བ་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་སོ།
en: The tathāgatas, arhats, completely awakened buddhas have originated from the bodhisattvas.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལས་བྱུང་བ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་སོ།
en: The śrāvakas and pratyekabuddhas have originated from the tathāgatas, arhats, completely awakened buddhas. “

source: །ཀཽ་ཤི་ཀ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོའམ། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་འམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོས།
en: So it is, Kauśika, that noble sons or noble daughters who follow the vehicle of the bodhisattvas, and noble sons or noble daughters who follow the vehicle of the śrāvakas or the vehicle of the pratyekabuddhas, should serve, respect, honor, {Ki.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱའོ། །བཀུར་སྟིར་བྱའོ།
en: II-III: 103} and worship this same perfection of wisdom with flowers, garlands, perfume, unguents, incense, butter lamps, powders, robes, parasols, victory banners, ribbons, and diverse musical sounds.

source: །བསྟི་སྟང་དུ་བྱའོ། །མཆོད་པར་བྱའོ། །དེ་ལྟར་དེ་ལ་སློབ་པའི། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Those noble sons or noble daughters who train accordingly have attained, will attain, and are attaining consummate buddhahood in unsurpassed, complete enlightenment.

source: །མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱིས་ཀྱང་། དགྲ་བཅོམ་པ་ཉིད་ཐོབ་བོ། །འཐོབ་བོ།
en: Those who follow the vehicle of the śrāvakas also have attained, will attain, and are attaining arhatship.

source: །ཐོབ་པར་འགྱུར་རོ། །རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱིས་ཀྱང་། རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཐོབ་བོ། །འཐོབ་བོ། །ཐོབ་པར་འགྱུར་རོ།
en: Those who follow the vehicle of the pratyekabuddhas also have attained, will attain, and are attaining individual enlightenment.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་ཉི་ཤུ་གཉིས་པའོ།། །།
en: This completes the twenty-second chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས་གལ་ཏེ། འཛམ་བུའི་གླིང་གི་སེམས་ཅན་དེ་དག་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་པར་གྱུར་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་དེའི་རྒྱུས་བསོད་ནམས་མང་དུ་འཕེལ་བར་འགྱུར་རམ།
en: Chapter 23: Śakra Then the Blessed One said to Śakra, mighty lord of the gods, “Kauśika, if any noble sons or noble daughters were to establish the beings of Jambudvīpa on the paths of the ten virtuous actions, do you think, Kauśika, that for this reason those noble sons or noble daughters would greatly increase their merit?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མང་ངོ་།
en: Blessed Lord, they would!

source: །བདེ་བར་གཤེགས་པ་མང་ངོ་།
en: Sugata, they would!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་བས་ཀྱང་ལ་ལ་ཞིག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའི་གླེགས་བམ་ཀླག་པའམ་བྲི་བའམ་ཁ་ཏོན་བྱ་བའི་ཕྱིར་གཞན་ལ་བྱིན་ན་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་ཟག་པ་མེད་པའི་ཆོས་གང་ལ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་སློབ་ཅིང་ཡང་དག་པའི་སྐྱོན་མེད་པར་ཞུགས་པར་གྱུར་པ་དང་། འཇུག་པ་དང་འཇུག་པར་འགྱུར་བ་དང་། དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་དུ་ཐོབ་པར་གྱུར་བ་དང་། འཐོབ་པ་དང་ཐོབ་པར་འགྱུར་བ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱིས་རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཐོབ་པར་གྱུར་པ་དང་། འཐོབ་པ་དང་། ཐོབ་པར་འགྱུར་བ་དང་།
en: The Blessed One then said, “Kauśika, if any were to bestow this perfection of wisdom on others so that they might recite it, commit it to writing, or chant it, they would even more greatly increase their merit.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་པ་དང་། འཇུག་པ་དང་འཇུག་པར་འགྱུར་བ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་མང་པོ་རྒྱ་ཆེར་བསྟན་ཏོ། །ཀཽ་ཤི་ཀ་ཟག་པ་མེད་པའི་ཆོས་དེ་དག་ཀྱང་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་བར་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: If you ask why, based on this perfection of wisdom, it is extensively revealed that there are many uncontaminated attributes through which noble sons or noble daughters, after training in it, have entered, will enter, and are entering into the maturity of the bodhisattvas; through which they have attained, will attain, and are attaining [the fruits and realizations], up to and including arhatship; through which followers of the vehicle of the pratyekabuddhas have attained, will attain, and are attaining the enlightenment of the pratyekabuddhas; through which those who enter into unsurpassed, complete enlightenment have entered, will enter, and are entering into the maturity of the bodhisattvas; and through which they have attained, will attain, and are attaining consummate buddhahood in unsurpassed, complete enlightenment. “

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དྲུག་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་།
en: Kauśika, if you ask what are those uncontaminated attributes, they comprise the perfection of generosity, [the other perfections], up to and including the perfection of wisdom, the emptiness of internal phenomena, [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the thirty-seven factors conducive to enlightenment, the four truths of the noble ones, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the six extrasensory powers, all the meditative stabilities, all the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, great loving kindness, great compassion, great empathetic joy, and great equanimity.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་དག་སྟེ་སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་པ་གཞན་དག་ཀྱང་རྒྱ་ཆེར་བསྟན་ཏོ།
en: There are also other immeasurable attributes of the buddhas that are extensively revealed. “

source: །ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས། སེམས་ཅན་གཅིག་ཅིག་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་བཞག་ན། དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་གྱི། འཛམ་བུའི་གླིང་གི་སེམས་ཅན་རྣམས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་པས་ནི་མ་ཡིན་ནོ།
en: Kauśika, if any noble sons or noble daughters established a single being in the fruit of entering the stream to nirvāṇa, their merit would increase more greatly, but by establishing the beings of Jambudvīpa in the paths of the ten virtuous actions, it would not.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་པའི་སེམས་ཅན་རྣམས་ནི། སེམས་ཅན་དམྱལ་བ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་ནས་ཡོངས་སུ་གྲོལ་བ་མ་ཡིན་ནོ།
en: If you ask why, Kauśika, the beings who are established in the paths of the ten virtuous actions are not liberated from rebirth in the hells or the animal realm or from the world of Yama.

source: །ཀཽ་ཤི་ཀ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་བཀོད་པའི་སེམས་ཅན་ནི། སེམས་ཅན་དམྱལ་བ་དང་བྱོལ་སོང་གི་སྐྱེ་གནས་དང་གཤིན་རྗེའི་འཇིག་རྟེན་ནས་ཡོངས་སུ་གྲོལ་བའི་ཕྱིར་ཏེ་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་ལ་བཀོད་པ་ལྟ་ཅི་སྨོས།
en: Kauśika, since beings who are established in the fruit of entering the stream to nirvāṇa are liberated from rebirth in the hells and the animal realm and from the world of Yama, what need one say about those who are established in the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and arhatship! {

source: ཀཽ་ཤི་ཀ་གང་ལ་ལས་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་རྣམས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་བཀོད་པ་དང་། དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་ལ་བཀོད་པ་བས་ལ་ལ་ཞིག་གིས་སེམས་ཅན་གཅིག་ཅིག་རང་བྱང་ཆུབ་ལ་བཞག་ན་དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: Ki.II-III: 104} “Kauśika, compared to any who establish beings of Jambudvīpa in the fruit of entering the stream to nirvāṇa and who establish them [in the other fruits], up to and including arhatship, if any were to establish a single being in individual enlightenment, their merit would increase more greatly.

source: །རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཐམས་ཅད་རང་བྱང་ཆུབ་ལ་བཀོད་པ་བས་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས་སེམས་ཅན་གཅིག་ཅིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བཞག་ན་དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Compared to any noble sons or noble daughters who establish all beings of Jambudvīpa in individual enlightenment, if any noble sons or noble daughters were to establish a single being in unsurpassed, complete enlightenment, their merit would increase more greatly.

source: སེམས་ཅན་གཅིག་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་གཞོག་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་ཚུལ་རྒྱུན་མི་འཆད་པའི་དོན་དུ་ཞུགས་པའི་ཕྱིར་རོ། །དེ་ཡང་ཅིའི་ཕྱིར་ཞེ་ན།
en: If you ask why, it is because one who establishes a single being in unsurpassed, complete enlightenment does so in order that the way to buddhahood might not be interrupted.

source: ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་ལས་བྱུང་བ་ནི་རྒྱུན་དུ་ཞུགས་པ་དང་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་དང་རང་སངས་རྒྱས་རྣམས་སོ།
en: And if you again ask why, Kauśika, those who enter the stream to nirvāṇa and so forth, up to and including the arhats and the pratyekabuddhas, have originated from the bodhisattvas.

source: །ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་ལས་བྱུང་བ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་སོ། །ཀཽ་ཤི་ཀ་རྣམ་གྲངས་དེས་ན།
en: Kauśika, the tathāgatas, arhats, completely awakened buddhas have originated from the bodhisattvas.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བ་ཡིན་ཏེ།
en: This formulation, Kauśika, explains how the bodhisattvas should be worshiped and honored.

source: འཇིག་རྟེན་ལྷ་དང་བཅས་པ་བདུད་དང་བཅས་པ་ཚངས་པ་དང་བཅས་པ་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུས་མེ་ཏོག་དང་ཕྲེང་བ་དང་། སྤོས་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་། ན་བཟའ་དང་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་དང་སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་།
en: One should know that they should be served, respected, honored, and worshiped with flowers, garlands, perfume, unguents, powders, robes, parasols, victory banners, ribbons, and diverse musical sounds by the world with its gods, its māras, its Brahmā deities, and its virtuous ascetics and brāhmins. “

source: བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པར་བྱ་བ་ཡིན་པར་ཤེས་པར་བྱའོ། །ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་པར་གྱུར་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ། བརྒྱ་བྱིན་གྱིས་གསོལ་པ།
en: Kauśika, if any noble sons or noble daughters were to establish all the beings of Jambudvīpa in the paths of the ten virtuous actions, do you think, Kauśika, that the merit of those noble sons or noble daughters would increase more greatly on that basis?” “

source: བཅོམ་ལྡན་འདས་མང་ངོ་།
en: It would, Blessed Lord!

source: ཀཽ་ཤི་ཀ་དེ་བས་ཀྱང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གླེགས་བམ་བྲི་བའམ་ཀླག་པའམ་ཁ་ཏོན་དུ་བྱ་བའི་ཕྱིར་གཞན་ལ་བྱིན་ན། བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: Kauśika,” continued the Blessed One, “compared to that, if any noble sons or noble daughters were to give this perfection of wisdom to others in order that they might commit it to writing in book form, recite it, or chant it, their merit would increase even more greatly.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་ཟག་པ་མེད་པའི་ཆོས་རྣམས་རྒྱ་ཆེར་བསྟན་ཏེ། དེ་དག་ལ་བསླབས་ཤིང་།
en: If you ask why, the uncontaminated attributes are extensively revealed through this perfection of wisdom.

source: རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དག་ཡང་དག་པའི་སྐྱོན་མེད་པར་ཞུགས་པར་གྱུར་ཏོ། །འཇུག་གོ། །འཇུག་པར་འགྱུར་རོ།།དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་དུ་ཐོབ་བོ། །འཐོབ་བོ།
en: Training in these, noble sons and noble daughters have entered, will enter, and are entering into authentic maturity, and they have attained, will attain, and are attaining [the fruits], up to and including arhatship. [

source: །ཐོབ་པར་འགྱུར་རོ། །རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱིས། རང་བྱང་ཆུབ་ཐོབ་པར་གྱུར་ཏོ། །འཐོབ་བོ། །ཐོབ་པར་འགྱུར་རོ།
en: Training in these], followers of the vehicle of the pratyekabuddhas have attained, will attain, and are attaining individual enlightenment. [

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱང་། ཡང་དག་པའི་སྐྱོན་མེད་པར་ཞུགས་པར་གྱུར་ཏོ། །འཇུག་གོ། །འཇུག་པར་འགྱུར་རོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་ཟག་པ་མེད་པའི་ཆོས་དེ་དག་ཀྱང་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མངོན་པར་ཤེས་པ་དྲུག་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་།
en: Training in these], bodhisattva great beings also have entered, will enter, and are entering into authentic maturity, and they have attained, will attain, and are attaining consummate buddhahood in unsurpassed, complete enlightenment. “

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: Kauśika, if you ask what are these uncontaminated attributes, they comprise the six perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the four truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the three gateways of liberation, the six extrasensory powers, all the meditative stabilities, all the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, great loving kindness, great compassion, great empathetic joy, and great equanimity.

source: དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་དག་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་པ་གཞན་དག་ཀྱང་རྒྱ་ཆེར་བསྟན་ཏོ། །ཀཽ་ཤི་ཀ་རྣམ་གྲངས་དེས་ཀྱང་རིགས་ཀྱི་བུའམ།
en: There are also other immeasurable attributes of the buddhas that are extensively revealed. “

source: རིགས་ཀྱི་བུ་མོ་གང་གིས།
en: Kauśika, {Ki.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གླེགས་བམ་དུ་བྱས་ཏེ། ཀླགས་པ་དང་། བྲི་བ་དང་། ཁ་ཏོན་དུ་བྱ་བའི་ཕྱིར་གཞན་ལ་བྱིན་ན། དེ་ནི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་བར་ཤེས་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་ཆོས་ཐམས་ཅད་རྒྱ་ཆེར་བསྟན་ཏེ། དེ་དག་ཡོད་པས་རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་ཡོད་དོ། །བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བ་དང་། ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་ཡོད་དོ། །རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཡོད་དོ། །སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་དང་། ཚངས་རིས་དང་ཚངས་ལྷ་ཉེ་ཕན་དང་།
en: II-III: 105} as this formulation also explains, one should know that any noble sons or noble daughters who make this perfection of wisdom into a book and give it to others in order that they might recite it, commit it to writing, and chant it, their merit will increase more greatly.
